# Exercises

### Data Aquisition

The end product of this exercise is a jupyter notebook (`classification_exercises.ipynb`) and `acquire.py`. The notebook will contain all your work as you move through the exercises. The acquire.py should contain the final functions.

In a jupyter notebook, `classification.ipynb`:

1. Use a python module containing datasets as a source for the iris dataset. Create a pandas dataframe, `df_iris`, from the data.

In [1]:
import pandas as pd
import seaborn as sns

In [2]:
def get_iris_data():
    return sns.load_dataset('iris')

In [3]:
df_iris = get_iris_data()

- Print the first 3 rows

In [4]:
df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

- Print the number of rows and columns (shape)

In [5]:
df_iris.shape

(150, 5)

- Print the columns names

In [6]:
df_iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

- Print the data types of each column

In [7]:
df_iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

- Print the summary statistics for each of the numeric variables. Would you recomend rescaling based on these statistics?

I would not recommend to rescale to because all measurments are in the same units.

In [8]:
df_iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

2. Read `Table1_CustDetails` the excel module dataset, `Excel_Exercises.xlsx`, into a dataframe, `df_excel`

In [9]:
def get_custdetails_data():
    return pd.read_excel('Excel_Exercises.xlsx', sheet_name =0)

In [10]:
df_excel = get_custdetails_data()

- assign the first 100 rows to a new dataframe, `df_excel_sample`

In [11]:
df_excel_sample = df_excel.head(100)
df_excel_sample

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.60,593.30,No
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.90,542.40,No
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.90,280.85,Yes
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.00,1237.85,Yes
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.90,267.40,Yes
5,0013-MHZWF,Female,0,No,Yes,1,1,0,Credit card (automatic),69.40,571.45,No
6,0013-SMEOE,Female,1,Yes,No,1,2,2,Bank transfer (automatic),109.70,7904.25,No
7,0014-BMAQU,Male,0,Yes,No,2,2,2,Credit card (automatic),84.65,5377.80,No
8,0015-UOCOJ,Female,1,No,No,1,1,0,Electronic check,48.20,340.35,No
9,0016-QLJIS,Female,0,Yes,Yes,2,1,2,Mailed check,90.45,5957.90,No
10,0017-DINOC,Male,0,No,No,0,1,2,Credit card (automatic),45.20,2460.55,No
11,0017-IUDMW,Female,0,Yes,Yes,2,2,2,Credit card (automatic),116.80,8456.75,No
12,0018-NYROU,Female,0,Yes,No,1,2,0,Electronic check,68.95,351.50,No
13,0019-EFAEP,Female,0,No,No,2,2,2,Bank transfer (automatic),101.30,7261.25,No
14,0019-GFNTW,Female,0,No,No,0,1,2,Bank transfer (automatic),45.05,2560.10,No
15,0020-INWCK,Female,0,Yes,Yes,2,2,2,Credit card (automatic),95.75,6849.40,No
16,0020-JDNXP,Female,0,Yes,Yes,0,1,1,Mailed check,61.25,1993.20,No
17,0021-IKXGC,Female,1,No,No,2,2,0,Electronic check,72.10,72.10,No
18,0022-TCJCI,Male,1,No,No,1,1,1,Credit card (automatic),62.70,2791.50,Yes
19,0023-HGHWL,Male,1,No,No,0,1,0,Electronic check,25.10,25.10,Yes
20,0023-UYUPN,Female,1,Yes,No,2,0,1,Electronic check,25.20,1306.30,No
21,0023-XUOPT,Female,0,Yes,No,2,2,0,Electronic check,94.10,1215.60,Yes
22,0027-KWYKW,Female,0,Yes,Yes,2,2,0,Electronic check,83.75,1849.95,No
23,0030-FNXPP,Female,0,No,No,1,0,0,Mailed check,19.85,57.20,No
24,0031-PVLZI,Female,0,Yes,Yes,1,0,0,Mailed check,20.35,76.35,Yes
25,0032-PGELS,Female,0,Yes,Yes,0,1,0,Bank transfer (automatic),30.50,30.50,Yes
26,0036-IHMOT,Female,0,Yes,Yes,1,2,1,Bank transfer (automatic),103.70,5656.75,No
27,0040-HALCW,Male,0,Yes,Yes,1,0,2,Credit card (automatic),20.40,1090.60,No
28,0042-JVWOJ,Male,0,No,No,1,0,1,Bank transfer (automatic),19.60,471.85,No
29,0042-RLHYP,Female,0,Yes,Yes,1,0,2,Bank transfer (automatic),19.70,1396.90,No
...,...,...,...,...,...,...,...,...,...,...,...,...
70,0114-RSRRW,Female,0,Yes,No,1,0,0,Bank transfer (automatic),19.95,187.75,No
71,0115-TFERT,Male,0,Yes,No,2,2,0,Electronic check,111.20,2317.10,Yes
72,0117-LFRMW,Male,0,Yes,Yes,0,1,0,Bank transfer (automatic),40.20,1448.80,Yes
73,0118-JPNOY,Female,1,No,No,1,2,0,Credit card (automatic),85.80,2193.65,No
74,0121-SNYRK,Male,0,No,No,0,1,1,Mailed check,35.40,1748.90,No
75,0122-OAHPZ,Female,0,No,No,2,2,0,Electronic check,73.85,511.25,Yes
76,0123-CRBRT,Female,0,Yes,Yes,2,1,2,Mailed check,88.10,5526.75,No
77,0125-LZQXK,Male,0,No,No,1,2,0,Electronic check,101.35,1553.95,Yes
78,0128-MKWSG,Female,0,No,Yes,0,1,0,Mailed check,45.80,1147.00,No
79,0129-KPTWJ,Male,0,Yes,No,1,2,0,Electronic check,94.65,6747.35,No
80,0129-QMPDR,Male,0,Yes,Yes,1,0,1,Bank transfer (automatic),20.50,865.05,No
81,0130-SXOUN,Male,0,No,No,2,2,0,Credit card (automatic),89.40,5976.90,No
82,0133-BMFZO,Female,0,No,No,1,2,0,Electronic check,86.25,181.65,Yes
83,0134-XWXCE,Female,1,No,No,1,1,1,Bank transfer (automatic),74.85,3268.05,No
84,0135-NMXAP,Female,0,No,No,2,2,0,Bank transfer (automatic),89.75,1052.40,Yes
85,0136-IFMYD,Male,1,Yes,No,2,2,2,Electronic check,109.95,7634.25,No
86,0137-OCGAB,Female,0,No,No,2,2,0,Mailed check,80.20,80.20,Yes
87,0137-UDEUO,Female,0,No,No,1,0,0,Mailed check,19.85,63.75,Yes
88,0139-IVFJG,Female,0,Yes,No,1,2,0,Electronic check,90.35,190.50,No
89,0141-YEAYS,Female,1,No,No,2,2,0,Bank transfer (automatic),86.45,2401.05,No
90,0142-GVYSN,Male,0,No,No,1,0,0,Electronic check,20.30,511.25,No
91,0147-ESWWR,Female,1,Yes,No,2,2,0,Electronic check,101.25,3949.15,No
92,0148-DCDOS,Male,0,No,No,2,2,0,Bank transfer (automatic),94.70,2362.10,Yes
93,0151-ONTOV,Female,0,No,No,1,2,0,Mailed check,70.90,70.90,Yes
94,0156-FVPTA,Male,0,Yes,No,1,1,0,Electronic check,54.20,1152.70,Yes
95,0164-APGRB,Female,0,No,No,2,2,2,Electronic check,114.90,8496.70,No
96,0164-XAIRP,Female,0,No,No,1,0,2,Bank transfer (automatic),19.55,470.20,No
97,0168-XZKBB,Female,0,Yes,No,2,2,0,Electronic check,86.85,1564.40,No
98,0174-QRVVY,Male,0,Yes,Yes,2,0,2,Credit card (automatic),25.35,1847.55,No
99,0177-PXBAT,Male,1,Yes,No,2,2,0,Bank transfer (automatic),109.90,3694.70,No

 - Print the number of rows of your original dataframe

In [12]:
df_excel.shape[0]

7049

In [13]:
df_excel.iloc[:,0:5].columns

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

- print the column names that have data type of `object`

In [14]:
pd.Series(df_excel.select_dtypes(object).columns)

0     customer_id
1          gender
2         partner
3      dependents
4    payment_type
5           churn
dtype: object

- compute the range for each of the numeric variables.

In [15]:
min_max = pd.DataFrame({'min': df_excel.select_dtypes([int,float]).min(),
              'max': df_excel.select_dtypes([int,float]).max()})
min_max

                     min      max
is_senior_citizen   0.00     1.00
phone_service       0.00     2.00
internet_service    0.00     2.00
contract_type       0.00     2.00
monthly_charges    18.25   118.75
total_charges      18.80  8684.80

3. Read the data from <https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357> google data sheet into a data frame

In [16]:
def get_train_data():
    sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
    csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')
    return pd.read_csv(csv_export_url)

In [17]:
df_google = get_train_data()

- print the first 3 rows

In [18]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

- print the number of rows and columns

In [19]:
df_google.shape

(891, 12)

- print the column names

In [20]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

- print the data type of each column

In [21]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

- print the summary statistics for each of the numeric values

In [22]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

- print the unique values for each of your catagorical variables

In [23]:
df_google.select_dtypes(object).columns

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [24]:
pd.Series(df_google.Name.unique())

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
5                                       Moran, Mr. James
6                                McCarthy, Mr. Timothy J
7                         Palsson, Master. Gosta Leonard
8      Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                    Nasser, Mrs. Nicholas (Adele Achem)
10                       Sandstrom, Miss. Marguerite Rut
11                              Bonnell, Miss. Elizabeth
12                        Saundercock, Mr. William Henry
13                           Andersson, Mr. Anders Johan
14                  Vestrom, Miss. Hulda Amanda Adolfina
15                      Hewlett, Mrs. (Mary D Kingcome)
16                                  Rice, Master. Eugene
17                          Williams, Mr. Charles Eugene
18     Vander Planke, Mrs. Julius (Emelia Maria Vande...
19                               Masselmani, Mrs. Fatima
20                                  Fynney, Mr. Joseph J
21                                 Beesley, Mr. Lawrence
22                           McGowan, Miss. Anna "Annie"
23                          Sloper, Mr. William Thompson
24                         Palsson, Miss. Torborg Danira
25     Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...
26                               Emir, Mr. Farred Chehab
27                        Fortune, Mr. Charles Alexander
28                         O'Dwyer, Miss. Ellen "Nellie"
29                                   Todoroff, Mr. Lalio
                             ...
861                          Giles, Mr. Frederick Edward
862    Swift, Mrs. Frederick Joel (Margaret Welles Ba...
863                    Sage, Miss. Dorothy Edith "Dolly"
864                               Gill, Mr. John William
865                             Bystrom, Mrs. (Karolina)
866                         Duran y More, Miss. Asuncion
867                 Roebling, Mr. Washington Augustus II
868                          van Melkebeke, Mr. Philemon
869                      Johnson, Master. Harold Theodor
870                                    Balkic, Mr. Cerin
871     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
872                             Carlsson, Mr. Frans Olof
873                          Vander Cruyssen, Mr. Victor
874                Abelson, Mrs. Samuel (Hannah Wizosky)
875                     Najib, Miss. Adele Kiamie "Jane"
876                        Gustafsson, Mr. Alfred Ossian
877                                 Petroff, Mr. Nedelio
878                                   Laleff, Mr. Kristo
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880         Shelley, Mrs. William (Imanita Parrish Hall)
881                                   Markun, Mr. Johann
882                         Dahlberg, Miss. Gerda Ulrika
883                        Banfield, Mr. Frederick James
884                               Sutehall, Mr. Henry Jr
885                 Rice, Mrs. William (Margaret Norton)
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Length: 891, dtype: object

In [25]:
pd.Series(df_google.Sex.unique())

0      male
1    female
dtype: object

In [26]:
pd.Series(df_google.Ticket.unique())

0             A/5 21171
1              PC 17599
2      STON/O2. 3101282
3                113803
4                373450
5                330877
6                 17463
7                349909
8                347742
9                237736
10              PP 9549
11               113783
12            A/5. 2151
13               347082
14               350406
15               248706
16               382652
17               244373
18               345763
19                 2649
20               239865
21               248698
22               330923
23               113788
24               347077
25                 2631
26                19950
27               330959
28               349216
29             PC 17601
             ...
651              315090
652           C.A. 5547
653              349213
654              347060
655            PC 17592
656              392091
657              113055
658                2629
659              350026
660               28134
661               17466
662              233866
663              236852
664       SC/PARIS 2149
665            PC 17590
666              345777
667              349248
668                 695
669              345765
670                2667
671              349212
672              349217
673              349257
674                7552
675    C.A./SOTON 34068
676     SOTON/OQ 392076
677              211536
678              112053
679              111369
680              370376
Length: 681, dtype: object

In [27]:
pd.Series(df_google.Cabin.unique())

0              NaN
1              C85
2             C123
3              E46
4               G6
5             C103
6              D56
7               A6
8      C23 C25 C27
9              B78
10             D33
11             B30
12             C52
13             B28
14             C83
15             F33
16           F G73
17             E31
18              A5
19         D10 D12
20             D26
21            C110
22         B58 B60
23            E101
24           F E69
25             D47
26             B86
27              F2
28              C2
29             E33
          ...
118            B20
119          F G63
120        C62 C64
121            E24
122            C90
123            C45
124             E8
125           B101
126            D45
127            C46
128            D30
129           E121
130            D11
131            E77
132            F38
133             B3
134             D6
135        B82 B84
136            D17
137            A36
138           B102
139            B69
140            E49
141            C47
142            D28
143            E17
144            A24
145            C50
146            B42
147           C148
Length: 148, dtype: object

In [28]:
pd.Series(df_google.Embarked.unique())

0      S
1      C
2      Q
3    NaN
dtype: object

### Data Acquistion

The end produect of this exercise should be the specified functions in a python script named `prepare.py`. Do these in your classification_exercises.ipynb first, then transfer to the prepare.py file.

    1. Iris Data
    
    a. Use the function defined `acquire.py` to load the iris data.

In [29]:
import numpy as np
import warnings
warnings.filterwarnings("ignore")

import acquire
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import MinMaxScaler
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer

In [30]:
df_iris = acquire.get_iris_data()

In [31]:
df_iris.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

    b. Drop the `species_id` and `measurement_id` columns.

In [32]:
df_iris.drop(columns = ['species_id', 'measurement_id'], inplace = True)

In [33]:
df_iris.head()

   sepal_length  sepal_width  petal_length  petal_width species_name
0           5.1          3.5           1.4          0.2       setosa
1           4.9          3.0           1.4          0.2       setosa
2           4.7          3.2           1.3          0.2       setosa
3           4.6          3.1           1.5          0.2       setosa
4           5.0          3.6           1.4          0.2       setosa

    c. Rename the `species_name column to just `species`

In [34]:
df_iris.rename(columns = {'species_name': 'species'}, inplace = True)

In [35]:
df_iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

    d. Encode the species name using a sklearn label encoder. Research the `inverse_transform` method of the label encoder. How might this be useful?

In [36]:
# Look at the entries, and data types of iris data
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
sepal_length    150 non-null float64
sepal_width     150 non-null float64
petal_length    150 non-null float64
petal_width     150 non-null float64
species         150 non-null object
dtypes: float64(4), object(1)
memory usage: 5.9+ KB

In [37]:
# Look at the value counts of iris species column
df_iris.species.value_counts(dropna=False)

setosa        50
virginica     50
versicolor    50
Name: species, dtype: int64

In [38]:
# Create the encoder object

In [39]:
encoder = LabelEncoder()

In [40]:
# fit the object to the data column we want to convert.
encoder.fit(df_iris.species)

LabelEncoder()

In [41]:
# transform the data with the encoder object
df_iris.species = encoder.transform(df_iris.species)

In [42]:
# Look at the values count with the transformed data
df_iris.species.value_counts()

2    50
1    50
0    50
Name: species, dtype: int64

In [43]:
# Perform an inverse transform to get back the string values of the data column.
df_iris.species = pd.Series(encoder.inverse_transform(df_iris.species))

In [44]:
def prep_iris(inverse_transform = False):
    df_iris = acquire.get_iris_data()
    df_iris.drop(columns = ['species_id', 'measurement_id'], inplace = True)
    df_iris.rename(columns = {'species_name': 'species'}, inplace = True)
    encoder = LabelEncoder()
    encoder.fit(df_iris.species)
    df_iris['species'] = encoder.transform(df_iris.species)
    if inverse_transform :
        df_iris.species = pd.Series(encoder.inverse_transform(df_iris.species))
    return df_iris

In [45]:
df_iris = prep_iris()

In [46]:
df_iris.head()

   sepal_length  sepal_width  petal_length  petal_width  species
0           5.1          3.5           1.4          0.2        0
1           4.9          3.0           1.4          0.2        0
2           4.7          3.2           1.3          0.2        0
3           4.6          3.1           1.5          0.2        0
4           5.0          3.6           1.4          0.2        0

2. Titanic Data

    a. Use the function you defined in the `acuire.py` to load the titanic data set.

In [47]:
df_titanic = acquire.get_titanic_data()

    b. Handle the missing values in `embark_town` and `embarked` columns.

In [48]:
#Look at titanic info to see how many entries are in each column
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
passenger_id    891 non-null int64
survived        891 non-null int64
pclass          891 non-null int64
sex             891 non-null object
age             714 non-null float64
sibsp           891 non-null int64
parch           891 non-null int64
fare            891 non-null float64
embarked        889 non-null object
class           891 non-null object
deck            203 non-null object
embark_town     889 non-null object
alone           891 non-null int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [49]:
#split the data into train and test
train, test = train_test_split(df_titanic, test_size = .3, random_state = 123, stratify = df_titanic.survived)

In [50]:
#Look at values in embarked column.
train.embarked.value_counts(dropna=False)

S      444
C      128
Q       50
NaN      1
Name: embarked, dtype: int64

In [51]:
train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
199,199,0,2,female,24.0,0,0,13.000,S,Second,None,Southampton,1
468,468,0,3,male,NaN,0,0,7.725,Q,Third,None,Queenstown,1
198,198,1,3,female,NaN,0,0,7.750,Q,Third,None,Queenstown,1
574,574,0,3,male,16.0,0,0,8.050,S,Third,None,Southampton,1
776,776,0,3,male,NaN,0,0,7.750,Q,Third,F,Queenstown,1

In [52]:
test.embarked.value_counts(dropna=False)

S      200
C       40
Q       27
NaN      1
Name: embarked, dtype: int64

In [53]:
#Fill the train & test NaN values with np.nan to handle transformations.
train.fillna(np.nan, inplace = True)
test.fillna(np.nan, inplace = True)

In [54]:
#Look at values in the train and test embark_town column.
train.embark_town.value_counts(dropna=False)

Southampton    444
Cherbourg      128
Queenstown      50
NaN              1
Name: embark_town, dtype: int64

In [55]:
test.embark_town.value_counts(dropna=False)

Southampton    200
Cherbourg       40
Queenstown      27
NaN              1
Name: embark_town, dtype: int64

In [56]:
# you have already filled all NaN values in train with the fillna function about

In [57]:
# Use SimpleImputer to fill in the missing values for each column using 'most_frequent'
# Create the SimpleImputer object
imp_mode = SimpleImputer(missing_values = np.nan, strategy = 'most_frequent')
imp_mode

SimpleImputer(add_indicator=False, copy=True, fill_value=None,
              missing_values=nan, strategy='most_frequent', verbose=0)

In [58]:
# Fit the Simple Imputer object to the train data.
imp_mode.fit(train[['embarked']])

SimpleImputer(add_indicator=False, copy=True, fill_value=None,
              missing_values=nan, strategy='most_frequent', verbose=0)

In [59]:
# transform the train data
train['embarked'] = imp_mode.transform(train[['embarked']])

In [60]:
# No more NaN values in our train embarked column
train['embarked'].value_counts(dropna = False)

S    445
C    128
Q     50
Name: embarked, dtype: int64

In [61]:
# Fit the Simple Imputer object to the test data.
imp_mode.fit(test[['embarked']])

SimpleImputer(add_indicator=False, copy=True, fill_value=None,
              missing_values=nan, strategy='most_frequent', verbose=0)

In [62]:
# transform the test data.
test['embarked'] = imp_mode.transform(test[['embarked']])

In [63]:
# No more NaN values in our test.embarked column.
test['embarked'].value_counts(dropna=False)

S    201
C     40
Q     27
Name: embarked, dtype: int64

In [64]:
#Handle NaN values in train embarked_town.
imp_mode.fit(train[['embark_town']])

SimpleImputer(add_indicator=False, copy=True, fill_value=None,
              missing_values=nan, strategy='most_frequent', verbose=0)

In [65]:
# Transform train 'embark_town' column.
train['embark_town'] = imp_mode.transform(train[['embark_town']])

In [66]:
# No more NaN values in our train embark_town column
train['embark_town'].value_counts(dropna = False)

Southampton    445
Cherbourg      128
Queenstown      50
Name: embark_town, dtype: int64

In [67]:
#Handle NaN values in test.embarked_town.
imp_mode = SimpleImputer(missing_values = np.nan, strategy = 'most_frequent')
imp_mode.fit(test[['embark_town']])

SimpleImputer(add_indicator=False, copy=True, fill_value=None,
              missing_values=nan, strategy='most_frequent', verbose=0)

In [68]:
# Transform test `embark_town` column
test['embark_town'] = imp_mode.transform(test[['embark_town']])

In [69]:
# No more NaN values in our test embark_town column
test['embark_town'].value_counts(dropna = False)

Southampton    201
Cherbourg       40
Queenstown      27
Name: embark_town, dtype: int64

    c. Remove the `deck` column.

In [70]:
train.drop(columns = ['deck'], inplace= True)
test.drop(columns = ['deck'], inplace = True)

In [71]:
train.columns, test.columns

(Index(['passenger_id', 'survived', 'pclass', 'sex', 'age', 'sibsp', 'parch',
        'fare', 'embarked', 'class', 'embark_town', 'alone'],
       dtype='object'),
 Index(['passenger_id', 'survived', 'pclass', 'sex', 'age', 'sibsp', 'parch',
        'fare', 'embarked', 'class', 'embark_town', 'alone'],
       dtype='object'))

    d. Use a label encoder to transform the `embarked` column.

In [72]:
# We want to make our categorical variable 'embarked' labeled with numbers instead of letters. Right now 'embarked' is an object datatype.
# Create our encode object using LabelEncoder.
int_encoder = LabelEncoder()
int_encoder

LabelEncoder()

In [73]:
# Fit the encoder object to our train data.
int_encoder.fit(train.embarked)

LabelEncoder()

In [74]:
# Transform the data using the encoder object that has been fitted to the train data.
train.embarked = int_encoder.transform(train.embarked)
train.embarked.value_counts(dropna = False)

2    445
0    128
1     50
Name: embarked, dtype: int64

In [75]:
# Fit the encoder to our test data.
int_encoder = LabelEncoder()
int_encoder.fit(test.embarked)

LabelEncoder()

In [76]:
test.embarked = int_encoder.transform(test.embarked)
test.embarked.value_counts(dropna=False)

2    201
0     40
1     27
Name: embarked, dtype: int64

    e. Scale the `age` and `fare` columns using a min max scaler. Why is this beneficial? When might you NOT want to do this?

In [77]:
train.fare.dtype

dtype('float64')

In [78]:
# Create a scaler object
scaler = MinMaxScaler()

In [79]:
# Work with one column at time.
# First fit train.fare
scaler.fit(train[['fare']])

MinMaxScaler(copy=True, feature_range=(0, 1))

In [80]:
# transform the scaler to our test.fare column.
train.fare = scaler.transform(train[['fare']])
test.fare = scaler.transform(test[['fare']])

In [81]:
# Create the scaler object and  fit train.age
scaler = MinMaxScaler()
scaler.fit(train[['age']])

MinMaxScaler(copy=True, feature_range=(0, 1))

In [82]:
# Transform the train.age column.
train.age = scaler.transform(train[['age']])
test.age = scaler.transform(test[['age']])

In [83]:
train[['age','fare']].head()

          age      fare
199  0.334089  0.025374
468       NaN  0.015078
198       NaN  0.015127
574  0.220742  0.015713
776       NaN  0.015127

In [84]:
test[['age', 'fare']].head()

          age      fare
178  0.419099  0.025374
457       NaN  0.101229
16   0.022386  0.056848
95        NaN  0.015713
120  0.291584  0.143462

In [85]:
scaler.get_params()

{'copy': True, 'feature_range': (0, 1)}

Why might this be beneficial?

This is beneficial because age is measured in time, and fare is measured by money. They are both continuous variables but measured on different scales. Using the Min Max scaler will give us back measurements of the same scale that are between 0 and 1.

Why might you NOT want to do this? When you put these on the same scale they could get weighted the same amount when we create our model. We might not want them to be considered equally.

    f. Create a function named `prep_titanic` that accepts the untransformed titanic data, and returns the data with the transformation above applied.

In [86]:
def prep_titanic():
    
    # Acquire titanic dataset
    df_titanic = acquire.get_titanic_data()
    
    # Fill NA values with np.nan
    df_titanic.fillna(np.nan, inplace = True)

    # Drop deck column
    df_titanic.drop(columns = ['deck'], inplace = True)

    # Split dataframe into train, test
    train, test = train_test_split(df_titanic, test_size = .3, random_state = 123, stratify = df_titanic.survived)

    # Train DataFrame: Fill values with 'most_frequent' that are np.NAN in embarked, embark_town
    imp_mode = SimpleImputer(missing_values = np.nan, strategy = 'most_frequent')
    imp_mode.fit(train[['embarked','embark_town']])
    train[['embarked','embark_town']] = imp_mode.transform(train[['embarked','embark_town']])

    # Test DataFrame: Put values with 'most_frequent' are np.NaN in embarked, embark_town
    imp_mode = SimpleImputer(missing_values = np.nan, strategy = 'most_frequent')
    imp_mode.fit(test[['embarked','embark_town']])
    test[['embarked','embark_town']] = imp_mode.transform(test[['embarked', 'embark_town']])

    # Change categorical variables in 'embarked' to numerical values
    int_encoder = LabelEncoder()
    int_encoder.fit(train[['embarked']])
    train[['embarked']] = int_encoder.transform(train[['embarked']])

    int_encoder = LabelEncoder()
    int_encoder.fit(test['embarked'])
    test[['embarked']] = int_encoder.transform(test[['embarked']])

    int_encoder = LabelEncoder()
    int_encoder.fit(train[['embark_town']])
    train[['embark_town']] = int_encoder.transform(train[['embark_town']])

    int_encoder = LabelEncoder()
    int_encoder.fit(test[['embark_town']])
    test[['embark_town']] = int_encoder.transform(test[['embark_town']])

    # Scale age and fare using MinMaxScaler
    scaler = MinMaxScaler()
    train[['age', 'fare']] = scaler.fit_transform(train[['age','fare']])
    test[['age','fare']] = scaler.transform(test[['age','fare']])
    return train, test, int_encoder

In [87]:
train, test, int_encoder = prep_titanic()

In [88]:
train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
199,199,0,2,female,0.334089,0,0,0.025374,2,Second,2,1
468,468,0,3,male,NaN,0,0,0.015078,1,Third,1,1
198,198,1,3,female,NaN,0,0,0.015127,1,Third,1,1
574,574,0,3,male,0.220742,0,0,0.015713,2,Third,2,1
776,776,0,3,male,NaN,0,0,0.015127,1,Third,1,1